Revit 2027 API
ElectricalSystem.CircuitPathMode Property
 The circuit path mode of the electrical system.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalCircuitPathMode CircuitPathMode { get; set; }
Public Property CircuitPathMode As ElectricalCircuitPathMode
	Get
	Set
public:
property ElectricalCircuitPathMode CircuitPathMode {
	ElectricalCircuitPathMode get ();
	void set (ElectricalCircuitPathMode value);
}
member CircuitPathMode : ElectricalCircuitPathMode with get, set
Property Value
ElectricalCircuitPathMode
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: The electrical system circuit path does not have customized path, so the CircuitPathMode cannot be set as Custom.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace